src/app/Controllers/Web/PatientController.php

SELECT "patients"."id", "patients"."image", "patients"."name", "patients"."mother_name", "patients"."birth_date", "patients"."cpf", "patients"."cns", "addresses"."zip_code", "addresses"."street", "addresses"."number", "addresses"."complement", "addresses"."neighborhood", "addresses"."city", "addresses"."state_id"
FROM "patients"
JOIN "addresses" ON "addresses"."patient_id" = "patients"."id"
JOIN "states" ON "states"."id" = "addresses"."state_id"
WHERE "patients"."deleted_at" IS NULL
AND "patients"."id" = '1'
SELECT *
FROM "states"
---
    public function edit(string $id): string|RedirectResponse
    {
        try {
            $patient = $this->patientModel->select('
                    patients.id, patients.image, patients.name, patients.mother_name, patients.birth_date, patients.cpf, patients.cns,
                    addresses.zip_code, addresses.street, addresses.number, addresses.complement, addresses.neighborhood, addresses.city, addresses.state_id
                ')
                ->join('addresses', 'addresses.patient_id = patients.id')
                ->join('states', 'states.id = addresses.state_id')
                ->find($id);

            if (!$patient) throw new PatientNotFoundException();

            $states = $this->stateModel->findAll();