src/app/Actions/Patient/PatientIndexAction.php

    public function execute(?string $search, ?string $searchDeleted): object
    {
        if ($search) {
            $this->patientModel->like('name', $search);
            $this->patientModel->orLike('cpf', $search);
            $this->patientModel->orLike('cns', $search);
        }

        if ($searchDeleted) $this->patientModel->onlyDeleted();

        $patients = $this->patientModel->select('id, name, cpf, cns, deleted_at')->orderBy('id')->paginate(10);
---
SELECT "id", "name", "cpf", "cns", "deleted_at"
FROM "patients"
WHERE "patients"."deleted_at" IS NULL
ORDER BY "id"
 LIMIT 10
SELECT COUNT(*) AS "numrows"
FROM "patients"
WHERE "patients"."deleted_at" IS NULL